notes/leetcode_124_binary_tree_maximum_path_sum.org
:PROPERTIES:
:ID:       D188B6DB-A827-4A63-B794-8708CEFB58B7
:END:
#+TITLE: Leetcode: 124. Binary Tree Maximum Path Sum
#+ANKI_DECK: Problem Solving
#+ANKI_CARD_ID: 1661446115465
#+ROAM_REFS: https://leetcode.com/problems/binary-tree-maximum-path-sum/

* Understand the Problem

Find the maximum path (sum of vertex values) in a tree.

** Useful prompts

- [[id:31D0B1E0-6881-478A-8F48-160BCFD94F31][Can we divide the search-space in two parts and combine solutions from both sides to solve the original problem?]]

- [[id:45B9F3C8-D007-4980-95EF-4361906245A8][How can we extend the solution for $i$ to $i+1$?]]

- [[id:37AF9679-42D1-4A85-9927-2A590268AD87][Blackbox: You solved a similar problem]].  Find the longest path in a tree which can be solved with two [[id:212DBFC3-FE3C-493E-86A6-42FF3F82CD53][Depth-first search]].

* Devise a plan

[[id:6DFC6B45-0302-44F2-AC2B-842531C4639B][Pattern: Find optimal path in a tree]] by [[id:C22502E9-D2E4-4874-BE0A-27E52B1E6499][Building the solution as you process the input]].  Be $u$ a node in the tree.  Find the maximum path starting from the left $l$ and from the right $r$ of $u$.  The maximum path starting from $u$ is either $val(u)$, $val(u)+l$ or $val(u)+r$.  To compute the final answer, we still have to consider $u$ as the root of the maximum path: $val(u)+l+r$.  Time complexity is $O(n)$ and space complexity is $O(depth)$.

** Carry out the plan

#+begin_src python
  # Definition for a binary tree node.
  # class TreeNode:
  #     def __init__(self, val=0, left=None, right=None):
  #         self.val = val
  #         self.left = left
  #         self.right = right
  class Solution:
      def maxPathSum(self, root: Optional[TreeNode]) -> int:
          def dfs(u):
              if u is None:
                  return (0, float("-inf"))
              al, ar = dfs(u.left)
              bl, br = dfs(u.right)
              return (
                  max(al, bl, 0) + u.val,
                  max(ar, br, max(al, 0) + u.val + max(bl, 0)),
              )

          return max(dfs(root))
#+end_src

#+begin_src python
  # Definition for a binary tree node.
  # class TreeNode:
  #     def __init__(self, val=0, left=None, right=None):
  #         self.val = val
  #         self.left = left
  #         self.right = right
  class Solution:
      def maxPathSum(self, root: Optional[TreeNode]) -> int:
          def dfs(node):
              if node is None:
                  return (0, float("-inf"))
              l = dfs(node.left)
              r = dfs(node.right)
              return (
                  node.val + max(l[0], r[0], 0),
                  max(max(l[0], 0) + node.val + max(r[0], 0), max(l[1], r[1])),
              )

          return max(dfs(root))
#+end_src

* Common mistakes

- [[id:29B5FD8A-98FD-48CE-8C30-04671E44AD27][Mistake: Missing edge case]].  The problem felt simple and I skipped the phase to create edge cases.
