leetcode_124_binary_tree_maximum_path_sum.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 124. Binary Tree Maximum Path Sum</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><a href="index.html">Problem Solving</a></nav><div id="content" class="content">
<h1 class="title">Leetcode: 124. Binary Tree Maximum Path Sum</h1>

<div id="outline-container-org03ca841" class="outline-2">
<h2 id="org03ca841">Understand the Problem</h2>
<div class="outline-text-2" id="text-org03ca841">
<p>
Find the maximum path (sum of vertex values) in a tree.
</p>
</div>

<div id="outline-container-org5e93c50" class="outline-3">
<h3 id="org5e93c50">Useful prompts</h3>
<div class="outline-text-3" id="text-org5e93c50">
<ul class="org-ul">
<li><a href="can_we_divide_the_search_space_in_two_parts_and_combine_solutions_from_both_sides_to_solve_the_original_problem.html#ID-31D0B1E0-6881-478A-8F48-160BCFD94F31">Can we divide the search-space in two parts and combine solutions from both sides to solve the original problem?</a></li>

<li><a href="how_can_we_extend_the_solution_for_i_to_i_1.html#ID-45B9F3C8-D007-4980-95EF-4361906245A8">How can we extend the solution for \(i\) to \(i+1\)?</a></li>

<li><a href="blackbox_you_solved_a_similar_problem.html#ID-37AF9679-42D1-4A85-9927-2A590268AD87">Blackbox: You solved a similar problem</a>.  Find the longest path in a tree which can be solved with two <a href="depth_first_search.html#ID-212DBFC3-FE3C-493E-86A6-42FF3F82CD53">Depth-first search</a>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4a287cf" class="outline-2">
<h2 id="org4a287cf">Devise a plan</h2>
<div class="outline-text-2" id="text-org4a287cf">
<p>
<a href="pattern_find_optimal_path_in_a_tree.html#ID-6DFC6B45-0302-44F2-AC2B-842531C4639B">Pattern: Find optimal path in a tree</a> by <a href="building_the_solution_as_you_process_the_input.html#ID-C22502E9-D2E4-4874-BE0A-27E52B1E6499">Building the solution as you process the input</a>.  Be \(u\) a node in the tree.  Find the maximum path starting from the left \(l\) and from the right \(r\) of \(u\).  The maximum path starting from \(u\) is either \(val(u)\), \(val(u)+l\) or \(val(u)+r\).  To compute the final answer, we still have to consider \(u\) as the root of the maximum path: \(val(u)+l+r\).  Time complexity is \(O(n)\) and space complexity is \(O(depth)\).
</p>
</div>

<div id="outline-container-orgc90afcc" class="outline-3">
<h3 id="orgc90afcc">Carry out the plan</h3>
<div class="outline-text-3" id="text-orgc90afcc">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Definition for a binary tree node.</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">class TreeNode:</span>
<span style="font-weight: bold; font-style: italic;">#     </span><span style="font-weight: bold; font-style: italic;">def __init__(self, val=0, left=None, right=None):</span>
<span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">self.val = val</span>
<span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">self.left = left</span>
<span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">self.right = right</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">maxPathSum</span>(<span style="font-weight: bold;">self</span>, root: Optional[TreeNode]) -&gt; <span style="font-weight: bold;">int</span>:
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dfs</span>(u):
            <span style="font-weight: bold;">if</span> u <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
                <span style="font-weight: bold;">return</span> (0, <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"-inf"</span>))
            <span style="font-weight: bold; font-style: italic;">al</span>, <span style="font-weight: bold; font-style: italic;">ar</span> = dfs(u.left)
            <span style="font-weight: bold; font-style: italic;">bl</span>, <span style="font-weight: bold; font-style: italic;">br</span> = dfs(u.right)
            <span style="font-weight: bold;">return</span> (
                <span style="font-weight: bold;">max</span>(al, bl, 0) + u.val,
                <span style="font-weight: bold;">max</span>(ar, br, <span style="font-weight: bold;">max</span>(al, 0) + u.val + <span style="font-weight: bold;">max</span>(bl, 0)),
            )

        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">max</span>(dfs(root))
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Definition for a binary tree node.</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">class TreeNode:</span>
<span style="font-weight: bold; font-style: italic;">#     </span><span style="font-weight: bold; font-style: italic;">def __init__(self, val=0, left=None, right=None):</span>
<span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">self.val = val</span>
<span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">self.left = left</span>
<span style="font-weight: bold; font-style: italic;">#         </span><span style="font-weight: bold; font-style: italic;">self.right = right</span>
<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">maxPathSum</span>(<span style="font-weight: bold;">self</span>, root: Optional[TreeNode]) -&gt; <span style="font-weight: bold;">int</span>:
        <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">dfs</span>(node):
            <span style="font-weight: bold;">if</span> node <span style="font-weight: bold;">is</span> <span style="font-weight: bold; text-decoration: underline;">None</span>:
                <span style="font-weight: bold;">return</span> (0, <span style="font-weight: bold;">float</span>(<span style="font-style: italic;">"-inf"</span>))
            <span style="font-weight: bold; font-style: italic;">l</span> = dfs(node.left)
            <span style="font-weight: bold; font-style: italic;">r</span> = dfs(node.right)
            <span style="font-weight: bold;">return</span> (
                node.val + <span style="font-weight: bold;">max</span>(l[0], r[0], 0),
                <span style="font-weight: bold;">max</span>(<span style="font-weight: bold;">max</span>(l[0], 0) + node.val + <span style="font-weight: bold;">max</span>(r[0], 0), <span style="font-weight: bold;">max</span>(l[1], r[1])),
            )

        <span style="font-weight: bold;">return</span> <span style="font-weight: bold;">max</span>(dfs(root))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org29e98eb" class="outline-2">
<h2 id="org29e98eb">Common mistakes</h2>
<div class="outline-text-2" id="text-org29e98eb">
<ul class="org-ul">
<li><a href="mistake_missing_edge_case.html#ID-29B5FD8A-98FD-48CE-8C30-04671E44AD27">Mistake: Missing edge case</a>.  The problem felt simple and I skipped the phase to create edge cases.</li>
</ul>
</div>
</div>
</div>
</body>
</html>